feat: convert monitora_cancer DAG diagram to mermaid
